Dlubal.RFEM5.NodalLoad
Nodal load parameters

Dlubal.RFEM5.NodalLoad.No
Number

Dlubal.RFEM5.NodalLoad.ID
Identifier

Dlubal.RFEM5.NodalLoad.Comment
Comment

Dlubal.RFEM5.NodalLoad.Tag
Tag

Dlubal.RFEM5.NodalLoad.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.NodalLoad.NodeList
List of nodes on which is the load defined

Dlubal.RFEM5.NodalLoad.Definition
Type of load definition

Dlubal.RFEM5.NodalLoad.Component
Nodal load component

Dlubal.RFEM5.NodalLoad.Direction
Nodal load direction